README 1.1
Added UML and flowchart diagrams to README.
